student_id = ""
f_name = "" #name
l_name = "" #last name
m_name = "" #dads name
hw_list = list()
pa_list = list()
visit = list()


#TODO: запрашшиваем айди студент
#TODO: 
# запрашшиваем ФИО студент
#проверить чтобы фио не содержало цифры, пробелы
#если фио некорректно, то оповещаем (еррор) и заново запросить каждую переменную то есть фио(continue) 
#если ввел правильно, то фио должно начинаться с большой буквы - применить title
#TODO: создать меню (while True)
#TODO: пункты меню: 
#TODO: 1.show student data - показать айди, фио
  #student ID:  <student_id>
  #full name: <l_name> <f_name> <m_name>
  #
# homeworks: 
   #<position>. <grade or minus>   1. 12
   #
#practical: 
# <position>. <grade or minus>   1. 12
#
#visit: 
#<position>. <present_or_absent>


# TODO: 2.show student stats: статистика
#дз и пз у которых '-' не участвуют в числении среднего(создаем переменную)
#нужно подсчитать количество оценок которые не равны "-"" потом использовать
#
# - ФИО;
# - общая средняя оценка по всем выполненным ДЗ и ПЗ; дз и пз у которых '-' не участвуют в числении среднего(создаем переменную)
# - средняя оценка за ПЗ;
# - количество выполненных ПЗ и общее количество ПЗ;
# - процент выполненных ПЗ;
# - средняя оценка за ДЗ;
# - количество выполненных ДЗ и общее количество ДЗ;
# - процент выполненных ДЗ; количество выполненных поделить на общее и поделить на 100
# - количество посещённых занятий и общее количество занятий;
# - процент посещений.


#TODO: 3.change full name 
#запросить что конкретно пользователь зочет изменить 1.имя 2.фамилия 3.отчество
# запросить фамилию - проверяем точно так же как наверху. если проверка прошла, меняь данные
# запросить имя - проверяем точно так же как наверху. если проверка прошла, меняь данные
# заросить отчество - проверяем точно так же как наверху. если проверка прошла, меняь данные

#TODO: 4.ADD HW
#условимся, что "-" означает дз, которое не оценено 
#hw_list.append("-") означает добавить дз

#TODO: 5. grade hw (оценить дз)
#запросить номер задания который лежит в hü_list
#проверить номер задания на границы (допустимые от 1 len(hw_list))
#если номер в порядке, запросить оценку 
#проверить оценку на границы (допцстимые целые от 1 до 12 включительно)
#если границы в порядке, то изменяем на новую оценку по индексу(позиция -1)

#TODO: 6.Delete hw grade
##запросить номер задания который лежит в hü_list
#проверить номер задания на границы (допустимые от 1 len(hw_list))
#если все в порядке, удаляем по индексу (позиция - 1)
#TODO: 7. 8. 9. пункты - тоже самое делаем с па
#TODO: 10. add visit
#показать под меню с пунктами 1 и 2 где 1 - present, 2 - absent
#запрашиваем выбор пункта. (choice = input)
#в лбом верном пункте добавляем  в list(visit) добавляем present or absent

#TODO: 11. change visit
#запрашиваем номер(день) посещения который лежит в list(visit)
#проверяем номер на границы (от 1 до len(list_visit))
#если номер посещения в порядке, то показать подменю  с пунктами 1 и 2 где 1 - present, 2 - absent
#запрашиваем выбор пункта, в обьрм верном пункте по указанному индексу(позиция -1) заменяем на present или absent
#TODO: 12.delete visit
#запросить номер посещения который хотим удалить
#проверяем номер на границы (допцстимые целые от 1 до 12 включительно)
#del list_visit(index)
#
#