student_id = ""
f_name = "" #name
l_name = "" #last name
m_name = "" #dads name
hw_list = list()
pa_list = list()
visit = list()


#TODO: запрашшиваем айди студент
#TODO: 
# запрашшиваем ФИО студент
#проверить чтобы фио не содержало цифры, пробелы
#если фио некорректно, то оповещаем (еррор) и заново запросить каждую переменную то есть фио(continue) 
#если ввел правильно, то фио должно начинаться с большой буквы - применить title
#TODO: создать меню (while True)
#TODO: пункты меню: 
#TODO: 1.show student data - показать айди, фио
  #student ID:  <student_id>
  #full name: <l_name> <f_name> <m_name>
  #
# homeworks: 
   #<position>. <grade or minus>   1. 12
   #
#practical: 
# <position>. <grade or minus>   1. 12
#
#visit: 
#<position>. <present_or_absent>


# TODO: 2.show student stats: статистика
# - ФИО;
# - общая средняя оценка по всем выполненным ДЗ и ПЗ;
# - средняя оценка за ПЗ;
# - количество выполненных ПЗ и общее количество ПЗ;
# - процент выполненных ПЗ;
# - средняя оценка за ДЗ;
# - количество выполненных ДЗ и общее количество ДЗ;
# - процент выполненных ДЗ;
# - количество посещённых занятий и общее количество занятий;
# - процент посещений.